In [8]:
import pandas as pd

In [23]:
# first case
a= pd.DataFrame([[1,2,3],[4,5,6]])

In [24]:
b= pd.DataFrame([[6,7,8],[9,10,11], [0,0,0]]).shift(1) #sift to shift columns

In [25]:
print(a)

   0  1  2
0  1  2  3
1  4  5  6

In [26]:
print(b)

     0     1     2
0  NaN   NaN   NaN
1  6.0   7.0   8.0
2  9.0  10.0  11.0

In [31]:
d= pd.concat([a, b], axis=1)
d

     0    1    2    0     1     2
0  1.0  2.0  3.0  NaN   NaN   NaN
1  4.0  5.0  6.0  6.0   7.0   8.0
2  NaN  NaN  NaN  9.0  10.0  11.0

In [60]:
# second case
x= pd.DataFrame([[1,2,3,], [4,5,6]])
x

   0  1  2
0  1  2  3
1  4  5  6

In [61]:
y= pd.DataFrame([[7,8,9], [10,11,12], [0,0,0]])
y

    0   1   2
0   7   8   9
1  10  11  12
2   0   0   0

In [62]:
f= pd.concat([x, y.shift(1)], axis=1)

In [63]:
f

     0    1    2     0     1     2
0  1.0  2.0  3.0   NaN   NaN   NaN
1  4.0  5.0  6.0   7.0   8.0   9.0
2  NaN  NaN  NaN  10.0  11.0  12.0